Pandas Module Practice

PART - 1

In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame(np.arange(0,20).reshape(5,4), index=['Row1','Row2','Row3', 'Row4', 'Row5'], columns=['Columns1','Columns2','Columns3','Columns4'])

In [4]:
df

      Columns1  Columns2  Columns3  Columns4
Row1         0         1         2         3
Row2         4         5         6         7
Row3         8         9        10        11
Row4        12        13        14        15
Row5        16        17        18        19

In [5]:
## convert this data into csv file 
df.to_csv("test1.csv")

In [6]:
## Accessing Elements
## 1. loc 2. iloc

df.loc["Row1"]

Columns1    0
Columns2    1
Columns3    2
Columns4    3
Name: Row1, dtype: int32

In [7]:
## check type 
type(df.loc["Row1"])

pandas.core.series.Series

In [8]:
df.iloc[:,:]

      Columns1  Columns2  Columns3  Columns4
Row1         0         1         2         3
Row2         4         5         6         7
Row3         8         9        10        11
Row4        12        13        14        15
Row5        16        17        18        19

In [9]:
type(df.iloc[:,:])

pandas.core.frame.DataFrame

In [10]:
df.iloc[0:1,0:1]

      Columns1
Row1         0

In [11]:
type(df.iloc[0:1,0:1])

pandas.core.frame.DataFrame

In [12]:
## access multiple columns 
df[["Columns3","Columns4"]]

      Columns3  Columns4
Row1         2         3
Row2         6         7
Row3        10        11
Row4        14        15
Row5        18        19

In [13]:
df.iloc[0:1,0]

Row1    0
Name: Columns1, dtype: int32

In [14]:
# note that for iloc 
type(df.iloc[0:1,0])

pandas.core.series.Series

In [15]:
df.iloc[:,1:]

      Columns2  Columns3  Columns4
Row1         1         2         3
Row2         5         6         7
Row3         9        10        11
Row4        13        14        15
Row5        17        18        19

In [16]:
## convert DataFrame into Array

In [17]:
df.iloc[:,1:].values

array([[ 1,  2,  3],
       [ 5,  6,  7],
       [ 9, 10, 11],
       [13, 14, 15],
       [17, 18, 19]])

In [18]:
df.iloc[:,1:].values.shape

(5, 3)

In [19]:
## check null values 
df.isnull()

      Columns1  Columns2  Columns3  Columns4
Row1     False     False     False     False
Row2     False     False     False     False
Row3     False     False     False     False
Row4     False     False     False     False
Row5     False     False     False     False

In [20]:
df.isnull().sum()

Columns1    0
Columns2    0
Columns3    0
Columns4    0
dtype: int64

In [21]:
df

      Columns1  Columns2  Columns3  Columns4
Row1         0         1         2         3
Row2         4         5         6         7
Row3         8         9        10        11
Row4        12        13        14        15
Row5        16        17        18        19

In [22]:
df["Columns1"].value_counts()

Columns1
0     1
4     1
8     1
12    1
16    1
Name: count, dtype: int64

In [23]:
df["Columns1"].unique()

array([ 0,  4,  8, 12, 16])

PART - 2

In [31]:
df = pd.read_csv("MercedesBenz.csv")

In [32]:
df.head()

,ID,y,X0,X1,X2,X3,X4,X5,X6,X8,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
0,0,130.81,k,v,at,a,d,u,j,o,...,0,0,1,0,0,0,0,0,0,0
1,6,88.53,k,t,av,e,d,y,l,o,...,1,0,0,0,0,0,0,0,0,0
2,7,76.26,az,w,n,c,d,x,j,x,...,0,0,0,0,0,0,1,0,0,0
3,9,80.62,az,t,n,f,d,x,l,e,...,0,0,0,0,0,0,0,0,0,0
4,13,78.02,az,v,n,f,d,h,d,n,...,0,0,0,0,0,0,0,0,0,0

In [33]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4209 entries, 0 to 4208
Columns: 378 entries, ID to X385
dtypes: float64(1), int64(369), object(8)
memory usage: 12.1+ MB

In [34]:
df.describe()

,ID,y,X10,X11,X12,X13,X14,X15,X16,X17,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
count,4209.000000,4209.000000,4209.000000,4209.0,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,...,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000
mean,4205.960798,100.669318,0.013305,0.0,0.075077,0.057971,0.428130,0.000475,0.002613,0.007603,...,0.318841,0.057258,0.314802,0.020670,0.009503,0.008078,0.007603,0.001663,0.000475,0.001426
std,2437.608688,12.679381,0.114590,0.0,0.263547,0.233716,0.494867,0.021796,0.051061,0.086872,...,0.466082,0.232363,0.464492,0.142294,0.097033,0.089524,0.086872,0.040752,0.021796,0.037734
min,0.000000,72.110000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,2095.000000,90.820000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
50%,4220.000000,99.150000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
75%,6314.000000,109.010000,0.000000,0.0,0.000000,0.000000,1.000000,0.000000,0.000000,0.000000,...,1.000000,0.000000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
max,8417.000000,265.320000,1.000000,0.0,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,...,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000

In [39]:
df.describe().mean().ID

3987.32118584217

In [48]:
df.describe().std().ID

2593.0619364047384

In [49]:
df.describe().min().ID

0.0

In [50]:
df.describe().max().ID

8417.0

In [51]:
## Get the unique category counts
df["X0"].value_counts()

X0
z     360
ak    349
y     324
ay    313
t     306
x     300
o     269
f     227
n     195
w     182
j     181
az    175
aj    151
s     106
ap    103
h      75
d      73
al     67
v      36
af     35
m      34
ai     34
e      32
ba     27
at     25
a      21
ax     19
aq     18
am     18
i      18
u      17
aw     16
l      16
ad     14
au     11
k      11
b      11
r      10
as     10
bc      6
ao      4
c       3
aa      2
q       2
ac      1
g       1
ab      1
Name: count, dtype: int64

In [52]:
df["X0"].unique()

array(['k', 'az', 't', 'al', 'o', 'w', 'j', 'h', 's', 'n', 'ay', 'f', 'x',
       'y', 'aj', 'ak', 'am', 'z', 'q', 'at', 'ap', 'v', 'af', 'a', 'e',
       'ai', 'd', 'aq', 'c', 'aa', 'ba', 'as', 'i', 'r', 'b', 'ax', 'bc',
       'u', 'ad', 'au', 'm', 'l', 'aw', 'ao', 'ac', 'g', 'ab'],
      dtype=object)

In [53]:
df["y"] > 100

0        True
1       False
2       False
3       False
4       False
        ...
4204     True
4205     True
4206     True
4207    False
4208     True
Name: y, Length: 4209, dtype: bool

In [54]:
df[df["y"] > 100]

,ID,y,X0,X1,X2,X3,X4,X5,X6,X8,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
0,0,130.81,k,v,at,a,d,u,j,o,...,0,0,1,0,0,0,0,0,0,0
6,24,128.76,al,r,e,f,d,f,h,s,...,0,0,0,0,0,0,0,0,0,0
8,27,108.67,w,s,as,e,d,f,i,h,...,1,0,0,0,0,0,0,0,0,0
9,30,126.99,j,b,aq,c,d,f,a,e,...,0,0,1,0,0,0,0,0,0,0
10,31,102.09,h,r,r,f,d,f,h,p,...,0,0,0,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4202,8402,123.34,ap,l,s,c,d,aa,d,r,...,0,0,0,0,0,0,0,0,0,0
4204,8405,107.39,ak,s,as,c,d,aa,d,q,...,1,0,0,0,0,0,0,0,0,0
4205,8406,108.77,j,o,t,d,d,aa,h,h,...,0,1,0,0,0,0,0,0,0,0
4206,8412,109.22,ak,v,r,a,d,aa,g,e,...,0,0,1,0,0,0,0,0,0,0
4208,8417,110.85,z,r,ae,c,d,aa,g,w,...,1,0,0,0,0,0,0,0,0,0

CSV

In [93]:
from io import StringIO, BytesIO

In [94]:
## specifying columns data type
data = ("a,b,c,d\n"
         "1,2,3,4\n"
         "5,6,7,8\n"
         "9,10,11,12\n")

In [95]:
print(data)

a,b,c,d
1,2,3,4
5,6,7,8
9,10,11,12

In [69]:
df = pd.read_csv(StringIO(data),dtype=object)

In [70]:
df

   a   b   c   d
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [80]:
df = pd.read_csv(StringIO(data),dtype={'a':int, 'b':float, 'c':'Int64'})

In [81]:
df

   a     b   c   d
0  1   2.0   3   4
1  5   6.0   7   8
2  9  10.0  11  12

In [82]:
df.dtypes

a      int32
b    float64
c      Int64
d      int64
dtype: object

In [83]:
df['b'][1]

6.0

In [84]:
type(df['b'][1])

numpy.float64

In [97]:
data1 = ("index,a,b,c\n"
         "1,apple,bat,4.4\n"
         "5,orange,cow,8.8\n")

In [98]:
print(data1)

index,a,b,c
1,apple,bat,4.4
5,orange,cow,8.8

In [107]:
df = pd.read_csv(StringIO(data1), index_col=0)
df

            a    b    c
index
1       apple  bat  4.4
5      orange  cow  8.8

In [108]:
df = pd.read_csv(StringIO(data1), index_col=1)
df

        index    b    c
a
apple       1  bat  4.4
orange      5  cow  8.8

In [109]:
data2 = ("a,b,c\n"
         "1,apple,bat\n"
         "5,orange,cow\n")

In [110]:
print(data2)

a,b,c
1,apple,bat
5,orange,cow

In [117]:
df = pd.read_csv(StringIO(data2), index_col=False)
df

   a       b    c
0  1   apple  bat
1  5  orange  cow

In [118]:
## combining of usecols and index_col
data3 = ("a,b,c\n"
         "1,apple,bat\n"
         "5,orange,cow\n")

In [121]:
df = pd.read_csv(StringIO(data3), usecols=["b","c"], index_col=False)
df

        b    c
0   apple  bat
1  orange  cow

In [122]:
## Quoting and Escape Charactors. very useful in NLP

data5 = 'a,b\n"hello, \\"bob\\", nice to see you", 5'

In [124]:
print(data5)

a,b
"hello, \"bob\", nice to see you", 5

In [127]:
df = pd.read_csv(StringIO(data5),escapechar='\\')
df

                               a  b
0  hello, "bob", nice to see you  5

In [131]:
## URL to CSV

In [138]:
df = pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/iris/iris.data')

In [139]:
df.head()

   5.1  3.5  1.4  0.2  Iris-setosa
0  4.9  3.0  1.4  0.2  Iris-setosa
1  4.7  3.2  1.3  0.2  Iris-setosa
2  4.6  3.1  1.5  0.2  Iris-setosa
3  5.0  3.6  1.4  0.2  Iris-setosa
4  5.4  3.9  1.7  0.4  Iris-setosa